zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
/*
 * Copyright (c) 2025 EXALT Technologies.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_sdmmc

#include <stm32_bitops.h>
#include <zephyr/cache.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/drivers/sdhc.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/util.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/device_mmio.h>

LOG_MODULE_REGISTER(sdhc_stm32, CONFIG_SDHC_LOG_LEVEL);

typedef void (*irq_config_func_t)(void);

BUILD_ASSERT((CONFIG_SDHC_BUFFER_ALIGNMENT % sizeof(uint32_t)) == 0U);

#define SDIO_OCR_SDIO_S18R BIT(24) /* SDIO OCR bit indicating support for 1.8V switching */

#ifndef SDMMC_FIFO_SIZE
#define SDMMC_FIFO_SIZE 32U
#endif

/* Set IDMA buffer address: adapts to series with IDMABASER vs IDMABASE0 */
#if defined(SDMMC_IDMABASER_IDMABASER)
#define SDHC_STM32_IDMA_SET_BUFFER(instance, addr) ((instance)->IDMABASER = (uint32_t)(addr))
#else
#define SDHC_STM32_IDMA_SET_BUFFER(instance, addr) ((instance)->IDMABASE0 = (uint32_t)(addr))
#endif

/* SDMMC data error flags */
#define SDMMC_DATA_ERROR_FLAGS                                                                     \
	(SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_RXOVERR | SDMMC_FLAG_TXUNDERR)

/* SDMMC wait flags for RX operations */
#define SDMMC_WAIT_RX_FLAGS                                                                        \
	(SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND)

/* SDMMC wait flags for TX operations */
#define SDMMC_WAIT_TX_FLAGS                                                                        \
	(SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND)

/* SDMMC wait flags for RX with DBCKEND */
#define SDMMC_WAIT_RX_DBCKEND_FLAGS                                                                \
	(SDMMC_WAIT_RX_FLAGS | SDMMC_FLAG_DBCKEND)

struct sdhc_stm32_config {
	DEVICE_MMIO_ROM;
	bool hw_flow_control;              /* flag for enabling hardware flow control */
	bool support_1_8_v;                /* flag indicating support for 1.8V signaling */
	unsigned int max_freq;             /* Max bus frequency in Hz */
	unsigned int min_freq;             /* Min bus frequency in Hz */
	uint8_t bus_width;                 /* Width of the SDMMC bus */
	uint16_t clk_div;                  /* Clock divider value to configure SDMMC clock speed */
	uint32_t power_delay_ms;           /* power delay prop for the host in milliseconds */
	struct stm32_pclken *pclken;       /* Pointer to peripheral clock configuration */
	const struct pinctrl_dev_config *pcfg; /* Pointer to pin control configuration */
	struct gpio_dt_spec sdhi_on_gpio;  /* Power pin to control the regulators used by card.*/
	struct gpio_dt_spec cd_gpio;       /* Card detect GPIO pin */
	irq_config_func_t irq_config_func; /* IRQ config function */
};

struct sdhc_stm32_data {
	DEVICE_MMIO_RAM;
	struct k_mutex bus_mutex;      /* Sync between commands */
	struct sdhc_io host_io;        /* Input/Output host configuration */
	struct sdhc_host_props props;  /* current host properties */
	struct k_sem device_sync_sem;  /* Sync between device communication messages */
	void *sdio_dma_buf;            /* DMA buffer for SDIO/SDMMC data transfer */
	uint32_t total_transfer_bytes; /* number of bytes transferred */
	uint32_t sdmmc_clk;            /* Specifies the clock*/
	uint32_t block_size;           /* Block size for SDMMC data transfer */
	uint32_t error_code;           /* SD Card Error codes */
	bool is_sdio_transfer;         /* Flag to indicate if current transfer is SDIO */

	uint32_t rx_xfer_size; /* SD Rx Transfer size */
	uint32_t tx_xfer_size; /* SD Tx Transfer size */
	bool is_multi_block;   /* Flag for multi-block transfers */
};

static SDMMC_TypeDef *sdhc_stm32_get_instance(const struct device *dev)
{
	return (SDMMC_TypeDef *)DEVICE_MMIO_GET(dev);
}

/*
 * Power on the card.
 *
 * This function toggles a GPIO to control the internal regulator used
 * by the card device. It handles GPIO configuration and timing delays.
 *
 * @param dev Device structure pointer.
 *
 * @return 0 on success, non-zero code on failure.
 */
static int sdhi_power_on(const struct device *dev)
{
	int ret;
	const struct sdhc_stm32_config *config = dev->config;

	if (!device_is_ready(config->sdhi_on_gpio.port)) {
		LOG_ERR("Card is not ready");
		return -ENODEV;
	}

	ret = gpio_pin_configure_dt(&config->sdhi_on_gpio, GPIO_OUTPUT_HIGH);
	if (ret < 0) {
		LOG_ERR("Card configuration failed, ret:%d", ret);
		return ret;
	}

	k_msleep(config->power_delay_ms);
	return ret;
}

#if CONFIG_SDHC_LOG_LEVEL >= LOG_LEVEL_ERR
static const struct {
	uint32_t mask;
	const char *msg;
} sdmmc_errors[] = {
	{SDMMC_ERROR_TX_UNDERRUN, "Transmit FIFO underrun during write"},
	{SDMMC_ERROR_RX_OVERRUN, "Receive FIFO overrun during read"},
	{SDMMC_ERROR_INVALID_PARAMETER, "Invalid parameter passed to SD/SDIO operation"},
	{SDMMC_ERROR_ILLEGAL_CMD, "Command is not legal for the card state"},
	{SDMMC_ERROR_BUSY, "SDHC interface is busy"},
	{SDMMC_ERROR_INVALID_VOLTRANGE, "Unsupported voltage range requested"},
	{SDMMC_ERROR_UNSUPPORTED_FEATURE, "Requested card feature is not supported"},
	{SDMMC_ERROR_DMA, "DMA transfer error occurred"},
	{SDMMC_ERROR_CID_CSD_OVERWRITE, "CID/CSD register overwrite attempted"},

	{SDMMC_ERROR_GENERAL_UNKNOWN_ERR, "General SDHC error"},
	{SDMMC_ERROR_REQUEST_NOT_APPLICABLE, "Request not applicable"},

	{SDMMC_ERROR_TIMEOUT, "Timeout occurred"},
	{SDMMC_ERROR_CMD_RSP_TIMEOUT, "Command response timeout"},
	{SDMMC_ERROR_DATA_TIMEOUT, "Data timeout"},

	{SDMMC_ERROR_CMD_CRC_FAIL, "Command CRC failure"},
	{SDMMC_ERROR_DATA_CRC_FAIL, "Data CRC failure"},
	{SDMMC_ERROR_COM_CRC_FAILED, "Communication CRC failure"},

	{SDMMC_ERROR_ADDR_MISALIGNED, "Address misaligned"},
	{SDMMC_ERROR_ADDR_OUT_OF_RANGE, "Address out of range"},

	{SDMMC_ERROR_WRITE_PROT_VIOLATION, "Write-protect violation"},
	{SDMMC_ERROR_LOCK_UNLOCK_FAILED, "Lock/unlock failure"},

	{SDMMC_ERROR_ERASE_RESET, "Erase reset"},
	{SDMMC_ERROR_AKE_SEQ_ERR, "Authentication sequence error"},

	{SDMMC_ERROR_BLOCK_LEN_ERR, "Block length error"},
	{SDMMC_ERROR_ERASE_SEQ_ERR, "Erase sequence error"},
	{SDMMC_ERROR_BAD_ERASE_PARAM, "Bad erase parameter"},
	{SDMMC_ERROR_WP_ERASE_SKIP, "Write-protected erase skipped"},
};
#endif /* CONFIG_SDHC_LOG_LEVEL >= LOG_LEVEL_ERR */

/**
 * Logs detailed SDIO error types using Zephyr's logging subsystem.
 *
 * This helper function queries the error status of an SDIO operation
 * and reports specific error types using `LOG_ERR()`.
 * In addition to logging, it also resets the `error_code` field
 * of the `SDIO_HandleTypeDef` to `HAL_SDIO_ERROR_NONE`.
 *
 * @param dev_data Pointer to the STM32 SDHC data structure.
 */
static void sdhc_stm32_log_err_type(struct sdhc_stm32_data *dev_data)
{
	uint32_t errors = dev_data->error_code;

	__ASSERT(errors != SDMMC_ERROR_NONE, "%s called with no error", __func__);

#if CONFIG_SDHC_LOG_LEVEL  >= LOG_LEVEL_ERR
	if (errors != 0U) {
		for (size_t i = 0; i < ARRAY_SIZE(sdmmc_errors); i++) {
			if ((errors & sdmmc_errors[i].mask) != 0U) {
				errors &= ~sdmmc_errors[i].mask;
				LOG_ERR("%s", sdmmc_errors[i].msg);
			}
		}

