zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
		if (errors != 0U) {
			LOG_ERR("Unknown error bit(s): 0x%08X", errors);
		}
	}
#endif /* CONFIG_SDHC_LOG_LEVEL  >= LOG_LEVEL_ERR */

	dev_data->error_code = SDMMC_ERROR_NONE;
}

/**
 * Initializes the SDHC peripheral with the configuration specified.
 *
 * This includes deinitializing any previous configuration, and applying
 * parameters like clock edge, power saving, clock divider, hardware
 * flow control and bus width.
 *
 * @param dev Pointer to the device structure for the SDHC peripheral.
 *
 * @return 0 on success, err code on failure.
 */
static int sdhc_stm32_sd_init(const struct device *dev)
{
	struct sdhc_stm32_data *data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);
	uint32_t sdmmc_clk_rate;

	data->host_io.bus_width = config->bus_width;

	SDMMC_PowerState_OFF(instance);

	/* Get SDMMC kernel clock rate: use pclken[1] (kernel clock) if available,
	 * otherwise fall back to pclken[0] (bus clock).
	 */
	if (DT_INST_NUM_CLOCKS(0) > 1) {
		if (clock_control_get_rate(clk,
					   (clock_control_subsys_t)&config->pclken[1],
					   &sdmmc_clk_rate) < 0) {
			LOG_ERR("Failed to get SDMMC clock rate");
			return -EIO;
		}
	} else {
		if (clock_control_get_rate(clk,
					   (clock_control_subsys_t)&config->pclken[0],
					   &sdmmc_clk_rate) < 0) {
			LOG_ERR("Failed to get SDMMC clock rate");
			return -EIO;
		}
	}
	data->sdmmc_clk = sdmmc_clk_rate;

	SDMMC_InitTypeDef init;

	init.ClockEdge = SDMMC_CLOCK_EDGE_FALLING;
	init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
	init.ClockDiv = config->clk_div;

	if (config->hw_flow_control) {
		init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_ENABLE;
	} else {
		init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
	}

	if (data->host_io.bus_width == SDHC_BUS_WIDTH4BIT) {
		init.BusWide = SDMMC_BUS_WIDE_4B;
	} else if (data->host_io.bus_width == SDHC_BUS_WIDTH8BIT) {
		init.BusWide = SDMMC_BUS_WIDE_8B;
	} else {
		init.BusWide = SDMMC_BUS_WIDE_1B;
	}

	if (SDMMC_Init(instance, init) != HAL_OK) {
		return -EIO;
	}

	SDMMC_PowerState_ON(instance);

	if (config->clk_div != 0) {
		sdmmc_clk_rate = data->sdmmc_clk / (2U * config->clk_div);
	}

	data->error_code = 0;
	data->is_multi_block = false;

	return 0;
}

static int sdhc_stm32_activate(const struct device *dev)
{
	int ret;
	const struct sdhc_stm32_config *config = (struct sdhc_stm32_config *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	if (DT_INST_NUM_CLOCKS(0) > 1) {
		if (clock_control_configure(clk,
					    (clock_control_subsys_t)&config->pclken[1],
					    NULL) != 0) {
			LOG_ERR("Failed to enable SDHC domain clock");
			return -EIO;
		}
	}

	if (clock_control_on(clk, (clock_control_subsys_t)&config->pclken[0]) != 0) {
		return -EIO;
	}

	return 0;
}

static void sdhc_stm32_disable_data_interrupts(SDMMC_TypeDef *instance)
{
	__SDMMC_DISABLE_IT(instance, SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
					     SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR |
					     SDMMC_IT_IDMABTC | SDMMC_IT_TXFIFOHE |
					     SDMMC_IT_RXFIFOHF);
}

static void sdhc_stm32_abort_dma_transfer(SDMMC_TypeDef *instance, struct sdhc_stm32_data *dev_data)
{
	sdhc_stm32_disable_data_interrupts(instance);
	__SDMMC_DISABLE_IT(instance, SDMMC_IT_IDMABTC);
	__SDMMC_CMDTRANS_DISABLE(instance);

	instance->DLEN = 0U;
	instance->IDMACTRL = SDMMC_DISABLE_IDMA;

	if (dev_data->is_sdio_transfer) {
		if ((instance->DCTRL & SDMMC_DCTRL_SDIOEN) != 0U) {
			instance->DCTRL = SDMMC_DCTRL_SDIOEN;
		} else {
			instance->DCTRL = 0U;
		}

		dev_data->is_sdio_transfer = false;
	} else {
		instance->DCTRL |= SDMMC_DCTRL_FIFORST;
		instance->CMD |= SDMMC_CMD_CMDSTOP;
		dev_data->error_code |= SDMMC_CmdStopTransfer(instance);
		instance->CMD &= ~(SDMMC_CMD_CMDSTOP);
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_DABORT);
		instance->DCTRL = 0U;
		dev_data->is_multi_block = false;
	}

	__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_IDMABTC);
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);
}

static uint32_t sdhc_stm32_convert_block_size(struct sdhc_stm32_data *dev_data)
{
	uint32_t block_size = dev_data->block_size;
#ifdef CONFIG_ASSERT
	struct sdhc_host_props *props = &dev_data->props;

	uint32_t max_block_len = SDMMC_DATABLOCK_SIZE_512B << props->host_caps.max_blk_len;
	uint32_t max_blk_size = max_block_len * BITS_PER_BYTE;

	__ASSERT(IS_POWER_OF_TWO(block_size) && block_size >= 1U && block_size <= max_blk_size,
		"Invalid block size: %u", block_size);
#endif
	/* SDMMC_DATABLOCK_SIZE_<n>B is log2(n) shifted to DBLOCKSIZE bit position */
	return LOG2(block_size) << SDMMC_DCTRL_DBLOCKSIZE_Pos;
}

static int sdhc_stm32_handle_data_error(SDMMC_TypeDef *instance, uint32_t errorcode,
					struct sdhc_stm32_data *data)
{
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
	data->error_code |= errorcode;
	if (errorcode == SDMMC_ERROR_DATA_TIMEOUT) {
		return -ETIMEDOUT;
	} else {
		return -EIO;
	}
}

static uint32_t sdhc_stm32_map_resp_type(uint32_t resp_type)
{
	switch (resp_type & SDHC_NATIVE_RESPONSE_MASK) {
	case SD_RSP_TYPE_R2:
		return SDMMC_RESPONSE_LONG;
	case SD_RSP_TYPE_NONE:
		return SDMMC_RESPONSE_NO;
	case SD_RSP_TYPE_R1:
	case SD_RSP_TYPE_R1b:
	case SD_RSP_TYPE_R3:
	case SD_RSP_TYPE_R4:
	case SD_RSP_TYPE_R5:
	case SD_RSP_TYPE_R5b:
	case SD_RSP_TYPE_R6:
	case SD_RSP_TYPE_R7:
	default:
		return SDMMC_RESPONSE_SHORT;
	}
}

/**
 * @brief Send a command to the SDMMC peripheral and wait for response.
 *
 * @param dev_data  Pointer to the STM32 SDHC driver data structure
 * @param instance  SDMMC peripheral base address
 * @param cmd       Zephyr SDHC command structure (opcode, arg, response_type, timeout_ms)
 * @return 0 on success, negative errno on failure
 */
static int sdhc_stm32_send_cmd(struct sdhc_stm32_data *dev_data, SDMMC_TypeDef *instance,
			struct sdhc_command *cmd)
{
	uint32_t response_reg_type = sdhc_stm32_map_resp_type(cmd->response_type);
	uint32_t native_rsp_type = cmd->response_type & SDHC_NATIVE_RESPONSE_MASK;
	uint32_t sta = 0U;
	bool ret;

	SDMMC_CmdInitTypeDef cmdinit = {
		.Argument = cmd->arg,
		.CmdIndex = cmd->opcode,
		.Response = response_reg_type,
		.WaitForInterrupt = SDMMC_WAIT_NO,
		.CPSM = SDMMC_CPSM_ENABLE,
	};

