zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	(void)SDMMC_SendCommand(instance, &cmdinit);

	if (response_reg_type == SDMMC_RESPONSE_NO) {
		/* No-response command (CMD0): wait for CMDSENT */
		ret = WAIT_FOR(instance->STA & SDMMC_FLAG_CMDSENT, cmd->timeout_ms * USEC_PER_MSEC,
			       k_yield());

		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_CMD_FLAGS);
		return ret ? 0 : -ETIMEDOUT;
	}

	/*
	 * Wait for response flags and CMDACT cleared.
	 * For R1b, include BUSYD0END to detect end of DAT0 busy signaling.
	 */
	uint32_t wait_flags = SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT | SDMMC_FLAG_CCRCFAIL;

	if (native_rsp_type == SD_RSP_TYPE_R1b) {
		wait_flags |= SDMMC_FLAG_BUSYD0END;
	}

	ret = WAIT_FOR(((sta = instance->STA) & wait_flags) && !(sta & SDMMC_FLAG_CMDACT),
		       cmd->timeout_ms * USEC_PER_MSEC, k_yield());

	if (!ret || (sta & SDMMC_FLAG_CTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_CMD_FLAGS);
		dev_data->error_code = SDMMC_ERROR_CMD_RSP_TIMEOUT;
		return -ETIMEDOUT;
	}

	if (sta & SDMMC_FLAG_CCRCFAIL) {
		/*
		 * R3 and R4 responses do not include a valid CRC
		 * field per SD specification. So, ignore CRC failure
		 * for these response types.
		 */
		if (native_rsp_type != SD_RSP_TYPE_R3 && native_rsp_type != SD_RSP_TYPE_R4) {
			__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_CCRCFAIL);
			return -EILSEQ;
		}
	}

	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_CMD_FLAGS);
	return 0;
}

static uint32_t handle_r1_errors(uint32_t resp)
{
	uint32_t err = 0;

	if ((resp & SDMMC_OCR_ERRORBITS) == 0U) {
		return 0;
	}

	struct {
		uint32_t flag;
		uint32_t error;
	} r1_errors[] = {
		{SDMMC_OCR_ADDR_OUT_OF_RANGE, SDMMC_ERROR_ADDR_OUT_OF_RANGE},
		{SDMMC_OCR_ADDR_MISALIGNED, SDMMC_ERROR_ADDR_MISALIGNED},
		{SDMMC_OCR_BLOCK_LEN_ERR, SDMMC_ERROR_BLOCK_LEN_ERR},
		{SDMMC_OCR_ERASE_SEQ_ERR, SDMMC_ERROR_ERASE_SEQ_ERR},
		{SDMMC_OCR_BAD_ERASE_PARAM, SDMMC_ERROR_BAD_ERASE_PARAM},
		{SDMMC_OCR_WRITE_PROT_VIOLATION, SDMMC_ERROR_WRITE_PROT_VIOLATION},
		{SDMMC_OCR_LOCK_UNLOCK_FAILED, SDMMC_ERROR_LOCK_UNLOCK_FAILED},
		{SDMMC_OCR_COM_CRC_FAILED, SDMMC_ERROR_COM_CRC_FAILED},
		{SDMMC_OCR_ILLEGAL_CMD, SDMMC_ERROR_ILLEGAL_CMD},
		{SDMMC_OCR_CARD_ECC_FAILED, SDMMC_ERROR_CARD_ECC_FAILED},
		{SDMMC_OCR_CC_ERROR, SDMMC_ERROR_CC_ERR},
		{SDMMC_OCR_STREAM_READ_UNDERRUN, SDMMC_ERROR_STREAM_READ_UNDERRUN},
		{SDMMC_OCR_STREAM_WRITE_OVERRUN, SDMMC_ERROR_STREAM_WRITE_OVERRUN},
		{SDMMC_OCR_CID_CSD_OVERWRITE, SDMMC_ERROR_CID_CSD_OVERWRITE},
		{SDMMC_OCR_WP_ERASE_SKIP, SDMMC_ERROR_WP_ERASE_SKIP},
		{SDMMC_OCR_CARD_ECC_DISABLED, SDMMC_ERROR_CARD_ECC_DISABLED},
		{SDMMC_OCR_ERASE_RESET, SDMMC_ERROR_ERASE_RESET},
		{SDMMC_OCR_AKE_SEQ_ERROR, SDMMC_ERROR_AKE_SEQ_ERR},
	};

	for (size_t i = 0; i < ARRAY_SIZE(r1_errors); i++) {
		if (resp & r1_errors[i].flag) {
			err |= r1_errors[i].error;
		}
	}

	if (err == 0) {
		err = SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
	}
	return err;
}

static uint32_t handle_r5_errors(uint32_t resp)
{
	uint32_t err = 0;
#ifdef SDMMC_SDIO_R5_ERRORBITS
	if ((resp & SDMMC_SDIO_R5_ERRORBITS) == 0U) {
		return 0;
	}

	if (resp & SDMMC_SDIO_R5_OUT_OF_RANGE) {
		err |= SDMMC_ERROR_ADDR_OUT_OF_RANGE;
	}
	if (resp & SDMMC_SDIO_R5_INVALID_FUNCTION_NUMBER) {
		err |= SDMMC_ERROR_INVALID_PARAMETER;
	}
	if (resp & SDMMC_SDIO_R5_ILLEGAL_CMD) {
		err |= SDMMC_ERROR_ILLEGAL_CMD;
	}
	if (resp & SDMMC_SDIO_R5_COM_CRC_FAILED) {
		err |= SDMMC_ERROR_COM_CRC_FAILED;
	}

	if (err == 0) {
		err = SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
	}
#else
	ARG_UNUSED(resp);
#endif /* SDMMC_SDIO_R5_ERRORBITS */
	return err;
}

static uint32_t handle_r6_errors(uint32_t resp)
{
	uint32_t err = 0;
#ifdef SDMMC_SDIO_R5_ERRORBITS
	if ((resp & SDMMC_SDIO_R5_ERRORBITS) == 0U) {
		return 0;
	}
#endif
	if (resp & SDMMC_R6_ILLEGAL_CMD) {
		err |= SDMMC_ERROR_ILLEGAL_CMD;
	}
	if (resp & SDMMC_R6_COM_CRC_FAILED) {
		err |= SDMMC_ERROR_COM_CRC_FAILED;
	}
	if (resp & SDMMC_R6_GENERAL_UNKNOWN_ERROR) {
		err |= SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
	}

	return err;
}

/**
 * @brief Validates SD/SDIO command response error flags
 *
 * This function inspects the first 32-bit response word returned by the card
 * and checks for error conditions according to the response type.
 *
 * @param dev_data Pointer to the STM32 SDHC driver private data structure.
 * @param cmd      Pointer to the SDHC command structure
 *
 * @retval 0        No error flags detected in the response.
 * @retval -EIO     An error flag was detected.
 *
 */
static int validate_response_err_flags(struct sdhc_stm32_data *dev_data, struct sdhc_command *cmd)
{
	uint32_t err = 0;
	uint32_t resp = cmd->response[0];

	switch (cmd->response_type) {

	case SD_RSP_TYPE_R1:
		err = handle_r1_errors(resp);
		break;

	case SD_RSP_TYPE_R5:
		err = handle_r5_errors(resp);
		break;

	case SD_RSP_TYPE_R6:
		err = handle_r6_errors(resp);
		break;

	default:
		return 0;
	}

	if (err != 0) {
		dev_data->error_code = err;
		return -EIO;
	}
	return 0;
}

/**
 * @brief Set response registers into cmd->response[] based on response type.
 *
 * @param dev_data  Pointer to the STM32 SDHC driver data structure
 * @param instance  SDMMC peripheral base address
 * @param cmd       Zephyr SDHC command structure
 */
static int sdhc_stm32_set_response(struct sdhc_stm32_data *dev_data, SDMMC_TypeDef *instance,
			    struct sdhc_command *cmd)
{
	uint32_t resp = sdhc_stm32_map_resp_type(cmd->response_type);

	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_CMD_FLAGS);
	switch (resp) {
	case SDMMC_RESPONSE_LONG:
		/* NOTE: RESPn registers are in "reverse order" for R2 response */
		cmd->response[0] = SDMMC_GetResponse(instance, SDMMC_RESP4);
		cmd->response[1] = SDMMC_GetResponse(instance, SDMMC_RESP3);
		cmd->response[2] = SDMMC_GetResponse(instance, SDMMC_RESP2);
		cmd->response[3] = SDMMC_GetResponse(instance, SDMMC_RESP1);
		break;
	case SDMMC_RESPONSE_SHORT:
		cmd->response[0] = SDMMC_GetResponse(instance, SDMMC_RESP1);
		return validate_response_err_flags(dev_data, cmd);
	case SDMMC_RESPONSE_NO:
	default:
		break;
	}

	return 0;
}

static void sdhc_stm32_read_fifo_block(SDMMC_TypeDef *instance, uint8_t **p_buf)
{
	__ASSERT_NO_MSG(p_buf != NULL);
	__ASSERT_NO_MSG(*p_buf != NULL);

