zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	uint32_t data;
	uint8_t *buf = *p_buf;

	for (uint32_t count = 0U; count < (SDMMC_HALFFIFOBYTES / sizeof(uint32_t)); count++) {
		data = SDMMC_ReadFIFO(instance);
		UNALIGNED_PUT(data, (uint32_t *)buf);
		buf += 4;
	}
	*p_buf = buf;
}

static void sdhc_stm32_write_fifo_block(SDMMC_TypeDef *instance, const uint8_t **p_buf)
{
	__ASSERT_NO_MSG(p_buf != NULL);
	__ASSERT_NO_MSG(*p_buf != NULL);

	uint32_t data;
	const uint8_t *buf = *p_buf;

	for (uint32_t count = 0U; count < (SDMMC_HALFFIFOBYTES / sizeof(uint32_t)); count++) {
		data = UNALIGNED_GET((const uint32_t *)buf);
		SDMMC_WriteFIFO(instance, &data);
		buf += 4;
	}
	*p_buf = buf;
}

static int sdhc_stm32_poll_read_transfer(SDMMC_TypeDef *instance, uint8_t **tempbuff,
					 uint32_t *dataremaining, uint32_t timeout,
					 struct sdhc_stm32_data *data)
{
	int ret;

	ret = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_RX_FLAGS), timeout * USEC_PER_MSEC, ({
				if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXFIFOHF) &&
				    (*dataremaining >= SDMMC_HALFFIFOBYTES)) {
					/* Read data from SDMMC Rx FIFO */
					sdhc_stm32_read_fifo_block(instance, tempbuff);
					*dataremaining -= SDMMC_HALFFIFOBYTES;
				}
				k_yield();
		       }));

	if (ret == 0) {
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		data->error_code |= SDMMC_ERROR_TIMEOUT;
		return -ETIMEDOUT;
	}
	return 0;
}

static int sdhc_stm32_poll_write_transfer(SDMMC_TypeDef *instance, const uint8_t **tempbuff,
					  uint32_t *dataremaining, uint32_t timeout,
					  struct sdhc_stm32_data *data)
{
	int ret;

	ret = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_TX_FLAGS), timeout * USEC_PER_MSEC, ({
				if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_TXFIFOHE) &&
				    (*dataremaining >= SDMMC_HALFFIFOBYTES)) {
					/* Write data to SDMMC Tx FIFO */
					sdhc_stm32_write_fifo_block(instance, tempbuff);
					*dataremaining -= SDMMC_HALFFIFOBYTES;
				}
				k_yield();
		       }));

	if (ret == 0) {
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		data->error_code |= SDMMC_ERROR_TIMEOUT;
		return -ETIMEDOUT;
	}
	return 0;
}

static int sdhc_stm32_send_stop_cmd(SDMMC_TypeDef *instance, uint32_t number_of_blocks,
				    struct sdhc_stm32_data *data)
{
	uint32_t errorstate;

	if (!__SDMMC_GET_FLAG(instance, SDMMC_FLAG_DATAEND) || (number_of_blocks <= 1U)) {
		return 0;
	}

	/* Send stop transmission command */
	errorstate = SDMMC_CmdStopTransfer(instance);
	if (errorstate != SDMMC_ERROR_NONE) {
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		data->error_code |= errorstate;
		return -EIO;
	}

	return 0;
}

static int sdhc_stm32_rw_blocks_poll(struct sdhc_stm32_data *dev_data, struct sdhc_command *cmd,
				     SDMMC_TypeDef *instance, void *p_data,
				     uint32_t number_of_blocks, uint32_t timeout, bool is_write)
{
	int res;
	SDMMC_DataInitTypeDef config = {0};
	uint32_t errorstate;
	uint32_t dataremaining;

	if (p_data == NULL) {
		dev_data->error_code |= SDMMC_ERROR_INVALID_PARAMETER;
		return -EINVAL;
	}

	dev_data->error_code = SDMMC_ERROR_NONE;

	/* Initialize data control register */
	instance->DCTRL = 0U;

	/* Configure the SD DPSM (Data Path State Machine) */
	config.DataTimeOut = SDMMC_DATATIMEOUT;
	config.DataLength = number_of_blocks * BLOCKSIZE;
	config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
	config.TransferDir = is_write ? SDMMC_TRANSFER_DIR_TO_CARD : SDMMC_TRANSFER_DIR_TO_SDMMC;
	config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	config.DPSM = SDMMC_DPSM_DISABLE;
	(void)SDMMC_ConfigData(instance, &config);
	__SDMMC_CMDTRANS_ENABLE(instance);

	/* Send read/write block command in polling mode */
	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res == 0) {
		res = sdhc_stm32_set_response(dev_data, instance, cmd);
	}
	if (res != 0) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		return -EIO;
	}

	/* Poll on SDMMC flags */
	dataremaining = config.DataLength;
	if (is_write) {
		const uint8_t *tempbuff = p_data;

		res = sdhc_stm32_poll_write_transfer(instance, &tempbuff, &dataremaining, timeout,
						     dev_data);
	} else {
		uint8_t *tempbuff = p_data;

		res = sdhc_stm32_poll_read_transfer(instance, &tempbuff, &dataremaining, timeout,
						    dev_data);
	}
	if (res != 0) {
		return res;
	}

	__SDMMC_CMDTRANS_DISABLE(instance);

	/* Send stop transmission command in case of multiblock transfer */
	res = sdhc_stm32_send_stop_cmd(instance, number_of_blocks, dev_data);
	if (res != 0) {
		return res;
	}

	/* Check for data transfer errors */
	errorstate = __SDMMC_GET_FLAG(instance, SDMMC_DATA_ERROR_FLAGS);
	if (errorstate != 0U) {
		return sdhc_stm32_handle_data_error(instance, errorstate, dev_data);
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	return 0;
}

static int sdhc_stm32_rw_blocks_dma(struct sdhc_command *cmd, SDMMC_TypeDef *instance,
				    const uint8_t *p_data, uint32_t number_of_blocks,
				    struct sdhc_stm32_data *dev_data, bool is_write)
{
	int res;
	SDMMC_DataInitTypeDef config = {0};
	uint32_t data_error_it;

	if (p_data == NULL) {
		dev_data->error_code |= SDMMC_ERROR_INVALID_PARAMETER;
		return -EINVAL;
	}

	dev_data->error_code = SDMMC_ERROR_NONE;

	/* Initialize data control register */
	instance->DCTRL = 0U;

	if (is_write) {
		dev_data->tx_xfer_size = BLOCKSIZE * number_of_blocks;
		config.TransferDir = SDMMC_TRANSFER_DIR_TO_CARD;
		data_error_it = SDMMC_IT_TXUNDERR;
	} else {
		dev_data->rx_xfer_size = BLOCKSIZE * number_of_blocks;
		config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
		data_error_it = SDMMC_IT_RXOVERR;
	}

	/* Configure the SD DPSM (Data Path State Machine) */
	config.DataTimeOut = SDMMC_DATATIMEOUT;
	config.DataLength = BLOCKSIZE * number_of_blocks;
	config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
	config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	config.DPSM = SDMMC_DPSM_DISABLE;
	(void)SDMMC_ConfigData(instance, &config);

	__SDMMC_CMDTRANS_ENABLE(instance);
	SDHC_STM32_IDMA_SET_BUFFER(instance, p_data);
	instance->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF;

	dev_data->is_multi_block = (number_of_blocks > 1U);

	/* Send read/write block command in DMA mode */
	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res == 0) {
		res = sdhc_stm32_set_response(dev_data, instance, cmd);
	}
	if (res != 0) {
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		dev_data->is_multi_block = false;
		return -EIO;
	}

	/* Enable transfer interrupts */
	__SDMMC_ENABLE_IT(instance, (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | data_error_it |
				     SDMMC_IT_DATAEND));

