zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	return 0;
}

static int sdhc_stm32_rw_blocks(struct sdhc_command *cmd, const struct device *dev,
				struct sdhc_data *data, bool is_write)
{
	int ret;
	struct sdhc_stm32_data *dev_data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);

	if (IS_ENABLED(CONFIG_SDHC_STM32_DMA_MODE)) {
		sys_cache_data_flush_range(data->data, data->blocks * data->block_size);

		ret = sdhc_stm32_rw_blocks_dma(cmd, instance, data->data, data->blocks, dev_data,
					       is_write);
	} else {
		ret = sdhc_stm32_rw_blocks_poll(dev_data, cmd, instance, data->data, data->blocks,
						data->timeout_ms, is_write);
	}

	if (IS_ENABLED(CONFIG_SDHC_STM32_DMA_MODE) && ret == 0) {
		if (k_sem_take(&dev_data->device_sync_sem, K_MSEC(data->timeout_ms)) != 0) {
			dev_data->error_code |= SDMMC_ERROR_TIMEOUT;
			sdhc_stm32_abort_dma_transfer(instance, dev_data);
			LOG_ERR("Timed out waiting for transfer completion");
			return -ETIMEDOUT;
		}

		if (!is_write) {
			sys_cache_data_invd_range(data->data, data->blocks * data->block_size);
		}
	}

	return ret;
}

static void sdhc_stm32_config_sdio_dpsm(SDMMC_TypeDef *instance, bool is_block_mode,
					uint32_t size_byte, SDMMC_DataInitTypeDef *config,
					bool is_write, struct sdhc_stm32_data *dev_data)
{
	/* Initialize data control register */
	if ((instance->DCTRL & SDMMC_DCTRL_SDIOEN) != 0U) {
		instance->DCTRL = SDMMC_DCTRL_SDIOEN;
	} else {
		instance->DCTRL = 0U;
	}

	/* Configure SDIO Data Path State Machine (DPSM) */
	config->DataTimeOut = SDMMC_DATATIMEOUT;

	if (is_block_mode) {
		uint32_t blocks = (size_byte & ~(dev_data->block_size & 1U)) >>
				  (find_lsb_set(dev_data->block_size) - 1);

		config->DataLength = blocks * dev_data->block_size;
		config->DataBlockSize = sdhc_stm32_convert_block_size(dev_data);
	} else {
		config->DataLength = (size_byte > 0U) ? size_byte : SDMMC_DEFAULT_BLOCK_SIZE;
		config->DataBlockSize = SDMMC_DATABLOCK_SIZE_1B;
	}

	config->TransferDir = is_write ? SDMMC_TRANSFER_DIR_TO_CARD : SDMMC_TRANSFER_DIR_TO_SDMMC;
	#ifdef SDMMC_TRANSFER_MODE_SDIO
		config->TransferMode = is_block_mode ? SDMMC_TRANSFER_MODE_BLOCK :
						       SDMMC_TRANSFER_MODE_SDIO;
	#else
		config->TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	#endif

	config->DPSM = SDMMC_DPSM_DISABLE;
}

static void sdhc_stm32_read_remaining_bytes(SDMMC_TypeDef *instance, uint8_t **tempbuff,
					    uint32_t *dataremaining)
{
	uint32_t data;
	uint8_t byte_count;
	uint8_t *buf = *tempbuff;
	uint32_t remaining = *dataremaining;

	while ((remaining > 0U) && !(__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXFIFOE))) {
		data = SDMMC_ReadFIFO(instance);
		if (remaining >= 4U) {
			UNALIGNED_PUT(data, (uint32_t *)buf);
			buf += 4;
			remaining -= 4;
		} else {
			for (byte_count = 0U; byte_count < remaining; byte_count++) {
				*buf = (uint8_t)((data >> (byte_count * 8U)) & 0xFFU);
				buf++;
			}
			remaining = 0;
		}
	}

	*tempbuff = buf;
	*dataremaining = remaining;
}

static void sdhc_stm32_write_remaining_bytes(SDMMC_TypeDef *instance, uint8_t **u8buff,
					     uint32_t *dataremaining)
{
	uint32_t data;
	uint8_t byte_count;
	uint8_t *buf = *u8buff;
	uint32_t remaining = *dataremaining;

	while (remaining > 0U) {
		if (remaining >= 4U) {
			data = UNALIGNED_GET((uint32_t *)buf);
			buf += 4;
			remaining -= 4;
		} else {
			data = 0U;
			for (byte_count = 0U; byte_count < remaining; byte_count++) {
				data |= ((uint32_t)(*buf) << (byte_count * BITS_PER_BYTE));
				buf++;
			}
			remaining = 0;
		}
		instance->FIFO = data;
	}

	*u8buff = buf;
	*dataremaining = remaining;
}

static void sdhc_stm32_write_fifo_words(SDMMC_TypeDef *instance, uint32_t **u32tempbuff)
{
	uint32_t *buf = *u32tempbuff;

	for (uint32_t reg_count = 0U;
	     reg_count < (SDMMC_HALFFIFOBYTES / sizeof(uint32_t));
	     reg_count++) {
		instance->FIFO = *buf++;
	}
	*u32tempbuff = buf;
}

static int sdhc_stm32_mmc_read_ext_csd(struct sdhc_stm32_data *dev_data, SDMMC_TypeDef *instance,
				       struct sdhc_command *cmd, struct sdhc_data *data)
{
	SDMMC_DataInitTypeDef config = {0};
	uint32_t errorstate;
	uint32_t dataremaining;
	uint32_t data_len;
	uint8_t *tempbuff;
	int res;

	if ((data == NULL) || (data->data == NULL)) {
		dev_data->error_code = SDMMC_ERROR_INVALID_PARAMETER;
		return -EINVAL;
	}

	data_len = data->block_size * data->blocks;
	if (data_len != SDMMC_DEFAULT_BLOCK_SIZE) {
		dev_data->error_code = SDMMC_ERROR_INVALID_PARAMETER;
		return -EINVAL;
	}

	dev_data->error_code = SDMMC_ERROR_NONE;

	/* Initialize data control register */
	instance->DCTRL = 0U;

	/* Configure the SDMMC DPSM (Data Path State Machine) */
	config.DataTimeOut = SDMMC_DATATIMEOUT;
	config.DataLength = data_len;
	config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
	config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
	config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	config.DPSM = SDMMC_DPSM_DISABLE;
	(void)SDMMC_ConfigData(instance, &config);
	__SDMMC_CMDTRANS_ENABLE(instance);

	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res == 0) {
		res = sdhc_stm32_set_response(dev_data, instance, cmd);
	}
	if (res != 0) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);
		return res;
	}

	/* Poll on SDMMC flags and transfer data from FIFO */
	dataremaining = config.DataLength;
	tempbuff = data->data;
	res = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_RX_FLAGS),
		       data->timeout_ms * USEC_PER_MSEC, ({
			if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXFIFOHF) &&
			    (dataremaining >= SDMMC_FIFO_SIZE)) {
				sdhc_stm32_read_fifo_block(instance, &tempbuff);
				dataremaining -= SDMMC_FIFO_SIZE;
			} else if (dataremaining < SDMMC_FIFO_SIZE) {
				sdhc_stm32_read_remaining_bytes(instance, &tempbuff,
								&dataremaining);
			}
			k_yield();
	       }));

	if (res == 0) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		dev_data->error_code |= SDMMC_ERROR_TIMEOUT;
		return -ETIMEDOUT;
	}

	__SDMMC_CMDTRANS_DISABLE(instance);

	/* Check for data transfer errors */
	errorstate = __SDMMC_GET_FLAG(instance, SDMMC_DATA_ERROR_FLAGS);
	if (errorstate != 0U) {
		return sdhc_stm32_handle_data_error(instance, errorstate, dev_data);
	}

