zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	/* Clear all static data flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	return 0;
}

static int sdhc_stm32_find_scr(struct sdhc_command *cmd, SDMMC_TypeDef *instance,
			       struct sdhc_stm32_data *dev_data, uint32_t scr[2],
			       uint32_t block_size, uint32_t buf_size)
{
	SDMMC_DataInitTypeDef config = {0};
	uint32_t index = 0U;
	uint32_t tempscr[2U] = {0UL, 0UL};
	int ret;

	if (buf_size < 8U) {
		dev_data->error_code = SDMMC_ERROR_INVALID_PARAMETER;
		return -EINVAL;
	}

	config.DataTimeOut = SDMMC_DATATIMEOUT;
	config.DataLength = block_size;
	config.DataBlockSize = SDMMC_DATABLOCK_SIZE_8B;
	config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
	config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	config.DPSM = SDMMC_DPSM_ENABLE;
	(void)SDMMC_ConfigData(instance, &config);

	ret = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (ret == 0) {
		ret = sdhc_stm32_set_response(dev_data, instance, cmd);
	}

	if (ret != 0) {
		return ret;
	}

	ret = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_RX_DBCKEND_FLAGS),
		       SDMMC_SWDATATIMEOUT * USEC_PER_MSEC, ({
				if ((!__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXFIFOE)) &&
				    (index == 0U)) {
					tempscr[0] = SDMMC_ReadFIFO(instance);
					tempscr[1] = SDMMC_ReadFIFO(instance);
					index++;
				}
				k_yield();
		       }));

	if (ret == 0) {
		dev_data->error_code |= SDMMC_ERROR_TIMEOUT;
		return -ETIMEDOUT;
	}

	if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_DTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_DTIMEOUT);
		dev_data->error_code |= SDMMC_ERROR_DATA_TIMEOUT;
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_DCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_DCRCFAIL);
		dev_data->error_code |= SDMMC_ERROR_DATA_CRC_FAIL;
		return -EILSEQ;
	} else if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXOVERR)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_RXOVERR);
		dev_data->error_code |= SDMMC_ERROR_RX_OVERRUN;
		return -EIO;
	}
	/* No error flag set */
	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	scr[0] = sys_cpu_to_be32(tempscr[1]);
	scr[1] = sys_cpu_to_be32(tempscr[0]);

	return 0;
}

void sdhc_stm32_irq_handler(SDMMC_TypeDef *instance, struct sdhc_stm32_data *dev_data)
{
	uint32_t errorcode = __SDMMC_GET_FLAG(instance, SDMMC_DATA_ERROR_FLAGS);
	bool data_end = __SDMMC_GET_FLAG(instance, SDMMC_FLAG_DATAEND) != 0U;

	if ((errorcode == 0U) && !data_end) {
		/* Clear IDMA buffer transfer complete interrupt flag */
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_IDMABTC);
		return;
	}

	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	sdhc_stm32_disable_data_interrupts(instance);
	__SDMMC_DISABLE_IT(instance, SDMMC_IT_IDMABTC);

	__SDMMC_CMDTRANS_DISABLE(instance);

	instance->DLEN = 0;
	instance->IDMACTRL = SDMMC_DISABLE_IDMA;

	if (dev_data->is_sdio_transfer) {
		if ((instance->DCTRL & SDMMC_DCTRL_SDIOEN) != 0U) {
			instance->DCTRL = SDMMC_DCTRL_SDIOEN;
		} else {
			instance->DCTRL = 0U;
		}

		dev_data->is_sdio_transfer = false;
	} else {
		if (errorcode != 0U) {
			instance->DCTRL |= SDMMC_DCTRL_FIFORST;
			instance->CMD |= SDMMC_CMD_CMDSTOP;
			dev_data->error_code |= SDMMC_CmdStopTransfer(instance);
			instance->CMD &= ~(SDMMC_CMD_CMDSTOP);
			__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_DABORT);
		} else {
			instance->DCTRL = 0U;

			if (dev_data->is_multi_block) {
				uint32_t stop_err = SDMMC_CmdStopTransfer(instance);

				if (stop_err != SDMMC_ERROR_NONE) {
					dev_data->error_code |= stop_err;
				}
			}
		}

		dev_data->is_multi_block = false;
	}

	if (errorcode != 0U) {
		dev_data->error_code |= errorcode;
		LOG_ERR("DMA transfer error: 0x%x", dev_data->error_code);
	} else {
		LOG_DBG("DMA transfer completed");
	}

	/* Clear IDMA buffer transfer complete interrupt flag */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_IDMABTC);
}

static int sdhc_stm32_sdio_rw_direct(struct sdhc_stm32_data *dev_data, SDMMC_TypeDef *instance,
			      struct sdhc_command *cmd)
{
	int res;

	dev_data->error_code = SDMMC_ERROR_NONE;

	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res == 0) {
		res = sdhc_stm32_set_response(dev_data, instance, cmd);
	}

	/* Disable command transfer path */
	__SDMMC_CMDTRANS_DISABLE(instance);

	/* Clear all static data flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	return res;
}

static int sdhc_stm32_sdio_rw_extended_poll(struct sdhc_command *cmd, SDMMC_TypeDef *instance,
					    bool is_block_mode, uint8_t *p_data,
					    uint32_t timeout_ms, struct sdhc_stm32_data *dev_data,
					    bool is_write)
{
	SDMMC_DataInitTypeDef config = {0};
	uint32_t errorstate;
	uint32_t dataremaining;
	uint8_t *tempbuff = p_data;
	int res;

	/* Set state to busy */
	dev_data->error_code = SDMMC_ERROR_NONE;

	/* Configure DPSM */
	sdhc_stm32_config_sdio_dpsm(instance, is_block_mode, dev_data->total_transfer_bytes,
				    &config, is_write, dev_data);
	(void)SDMMC_ConfigData(instance, &config);
	__SDMMC_CMDTRANS_ENABLE(instance);

	/* Send CMD53 */
	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res == 0) {
		res = sdhc_stm32_set_response(dev_data, instance, cmd);
	}
	if (res != 0) {
		stm32_reg_modify_bits(&instance->DCTRL, SDMMC_DCTRL_FIFORST, SDMMC_DCTRL_FIFORST);
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);
		return -EIO;
	}

	/* Poll on SDMMC flags and transfer data from/to FIFO */
	dataremaining = config.DataLength;

	if (is_write) {
		uint32_t *u32tempbuff = (uint32_t *)tempbuff;

		res = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_TX_FLAGS),
			       timeout_ms * USEC_PER_MSEC, ({
				if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_TXFIFOHE) &&
				    (dataremaining >= SDMMC_HALFFIFOBYTES)) {
					sdhc_stm32_write_fifo_words(instance, &u32tempbuff);
					dataremaining -= SDMMC_HALFFIFOBYTES;
				} else if ((dataremaining < SDMMC_HALFFIFOBYTES) &&
					   (__SDMMC_GET_FLAG(instance,
						     SDMMC_FLAG_TXFIFOHE | SDMMC_FLAG_TXFIFOE))) {
					uint8_t *u8buff = (uint8_t *)u32tempbuff;

					sdhc_stm32_write_remaining_bytes(instance, &u8buff,
									 &dataremaining);
					u32tempbuff = (uint32_t *)u8buff;
				}
				k_yield();
		       }));
	} else {
		res = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_RX_FLAGS),
			       timeout_ms * USEC_PER_MSEC, ({
				if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXFIFOHF) &&
				    (dataremaining >= SDMMC_HALFFIFOBYTES)) {
					sdhc_stm32_read_fifo_block(instance, &tempbuff);
					dataremaining -= SDMMC_HALFFIFOBYTES;
				} else if (dataremaining < SDMMC_HALFFIFOBYTES) {
					sdhc_stm32_read_remaining_bytes(instance, &tempbuff,
									&dataremaining);
				}
				k_yield();
		       }));
	}

	if (res == 0) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		dev_data->error_code |= SDMMC_ERROR_TIMEOUT;
		return -ETIMEDOUT;
	}

	__SDMMC_CMDTRANS_DISABLE(instance);

	/* Check for data transfer errors */
	errorstate = __SDMMC_GET_FLAG(instance, SDMMC_DATA_ERROR_FLAGS);
	if (errorstate != 0U) {
		return sdhc_stm32_handle_data_error(instance, errorstate, dev_data);
	}

