zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	/* Clear all static data flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	return 0;
}

static int sdhc_stm32_sdio_rw_extended_dma(struct sdhc_command *cmd, SDMMC_TypeDef *instance,
					   bool is_block_mode, struct sdhc_stm32_data *dev_data,
					   bool is_write)
{
	SDMMC_DataInitTypeDef config = {0};
	int res;

	/* Set state to busy */
	dev_data->error_code = SDMMC_ERROR_NONE;

	dev_data->is_sdio_transfer = true;

	/* Configure DMA (use single buffer mode) */
	instance->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
	SDHC_STM32_IDMA_SET_BUFFER(instance, dev_data->sdio_dma_buf);

	/* Configure SDIO Data Path State Machine (DPSM) */
	sdhc_stm32_config_sdio_dpsm(instance, is_block_mode, dev_data->total_transfer_bytes,
				    &config, is_write, dev_data);

	(void)SDMMC_ConfigData(instance, &config);

	__SDMMC_CMDTRANS_ENABLE(instance);

	/* Send CMD53 */
	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res == 0) {
		res = sdhc_stm32_set_response(dev_data, instance, cmd);
	}
	if (res != 0) {
		stm32_reg_modify_bits(&instance->DCTRL, SDMMC_DCTRL_FIFORST, SDMMC_DCTRL_FIFORST);
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
		__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);
		return -EIO;
	}

	/* Enable interrupts for DMA transfer */
	__SDMMC_ENABLE_IT(instance,
			  (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
			   (is_write ? SDMMC_IT_TXUNDERR : SDMMC_IT_RXOVERR) | SDMMC_IT_DATAEND));

	return 0;
}

static int sdhc_stm32_switch_speed(SDMMC_TypeDef *instance, uint32_t switch_arg, uint8_t status[64],
				   uint32_t block_size, uint32_t buf_size,
				   struct sdhc_stm32_data *dev_data)
{
	uint32_t errorstate;
	SDMMC_DataInitTypeDef sdmmc_datainitstructure;
	uint32_t sd_hs[16] = {0};
	uint32_t loop = 0;
	int ret;

	if ((block_size == 0U) || (block_size % sizeof(uint32_t) != 0U) || (buf_size < 64U)) {
		dev_data->error_code = SDMMC_ERROR_INVALID_PARAMETER;
		return -EINVAL;
	}

	/* Initialize the Data control register */
	instance->DCTRL = 0;

	/* Configure the SD DPSM (Data Path State Machine) */
	sdmmc_datainitstructure.DataTimeOut = SDMMC_DATATIMEOUT;
	sdmmc_datainitstructure.DataLength = block_size;
	sdmmc_datainitstructure.DataBlockSize = SDMMC_DATABLOCK_SIZE_64B;
	sdmmc_datainitstructure.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
	sdmmc_datainitstructure.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	sdmmc_datainitstructure.DPSM = SDMMC_DPSM_ENABLE;

	(void)SDMMC_ConfigData(instance, &sdmmc_datainitstructure);

	errorstate = SDMMC_CmdSwitch(instance, switch_arg);
	if (errorstate != SDMMC_ERROR_NONE) {
		dev_data->error_code |= errorstate;
		return -EIO;
	}

	ret = WAIT_FOR(__SDMMC_GET_FLAG(instance, SDMMC_WAIT_RX_DBCKEND_FLAGS),
		       SDMMC_SWDATATIMEOUT * USEC_PER_MSEC, ({
			if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXFIFOHF)) {
				if ((loop + 1) * SDMMC_HALFFIFOBYTES <= sizeof(sd_hs)) {
					uint8_t *buf =
						((uint8_t *)sd_hs) + (loop * SDMMC_HALFFIFOBYTES);

					sdhc_stm32_read_fifo_block(instance, &buf);
					loop++;
				}
			}
			k_yield();
		       }));

	if (ret == 0) {
		dev_data->error_code |= SDMMC_ERROR_TIMEOUT;
		return -ETIMEDOUT;
	}

	if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_DTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_DTIMEOUT);
		dev_data->error_code |= SDMMC_ERROR_DATA_TIMEOUT;
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_DCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_DCRCFAIL);
		dev_data->error_code |= SDMMC_ERROR_DATA_CRC_FAIL;
		return -EILSEQ;
	} else if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_RXOVERR)) {
		__SDMMC_CLEAR_FLAG(instance, SDMMC_FLAG_RXOVERR);
		dev_data->error_code |= SDMMC_ERROR_RX_OVERRUN;
		return -EIO;
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_DATA_FLAGS);

	/* Copy switch status to output buffer */
	if (status != NULL) {
		memcpy(status, sd_hs, sizeof(sd_hs));
	}

	return 0;
}

static int sdhc_stm32_rw_extended(const struct device *dev, struct sdhc_command *cmd,
				  struct sdhc_data *data)
{
	int res;
	struct sdhc_stm32_data *dev_data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);
	bool direction = cmd->arg >> SDIO_CMD_ARG_RW_SHIFT;
	bool is_block_mode = cmd->arg & BIT(SDIO_EXTEND_CMD_ARG_BLK_SHIFT);

	if (data->data == NULL) {
		LOG_ERR("Invalid NULL data buffer passed to CMD53");
		return -EINVAL;
	}

	dev_data->block_size = is_block_mode ? data->block_size : 0;
	dev_data->total_transfer_bytes = data->blocks * data->block_size;

	if (IS_ENABLED(CONFIG_SDHC_STM32_DMA_MODE)) {
		dev_data->sdio_dma_buf = k_aligned_alloc(CONFIG_SDHC_BUFFER_ALIGNMENT,
							 data->blocks * data->block_size);
		if (dev_data->sdio_dma_buf == NULL) {
			LOG_ERR("DMA buffer allocation failed");
			return -ENOMEM;
		}

		if (direction == SDIO_IO_WRITE) {
			memcpy(dev_data->sdio_dma_buf, data->data, dev_data->total_transfer_bytes);
		}

		sys_cache_data_flush_range(dev_data->sdio_dma_buf, dev_data->total_transfer_bytes);
		res = sdhc_stm32_sdio_rw_extended_dma(cmd, instance, is_block_mode, dev_data,
						      direction);

		/* Only wait on semaphore if HAL function succeeded */
		if (res != 0) {
			k_free(dev_data->sdio_dma_buf);
			return res;
		}

		/* Wait for whole transfer to complete */
		if (k_sem_take(&dev_data->device_sync_sem, K_MSEC(data->timeout_ms)) != 0) {
			dev_data->error_code |= SDMMC_ERROR_TIMEOUT;
			sdhc_stm32_abort_dma_transfer(instance, dev_data);
			k_free(dev_data->sdio_dma_buf);
			return -ETIMEDOUT;
		}

		if (direction == SDIO_IO_READ) {
			sys_cache_data_invd_range(dev_data->sdio_dma_buf,
						  dev_data->total_transfer_bytes);
			memcpy(data->data, dev_data->sdio_dma_buf, data->block_size * data->blocks);
		}

		k_free(dev_data->sdio_dma_buf);
	} else {
		res = sdhc_stm32_sdio_rw_extended_poll(cmd, instance, is_block_mode, data->data,
						       data->timeout_ms, dev_data, direction);
	}

	return res;
}

/**
 * @brief Switch the SDMMC interface to 1.8V signaling level.
 *
 * This function performs the voltage switching sequence required for
 * UHS (Ultra High Speed) mode operation.
 *
 * @param dev  Pointer to the device structure for the SDHC instance.
 * @param cmd  Pointer to the SD command used in the voltage switch sequence.
 *
 * @return 0 on success, negative errno on failure
 */
static int sdhc_stm32_switch_to_1_8v(const struct device *dev, struct sdhc_command *cmd)
{
	uint32_t res;
	struct sdhc_stm32_data *dev_data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);

	instance->POWER |= SDMMC_POWER_VSWITCHEN;

	res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
	if (res != 0) {
		return res;
	}

