zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	res = sdhc_stm32_set_response(dev_data, instance, cmd);
	if (res != 0) {
		return res;
	}

	LOG_DBG("Successfully switched to 1.8V signaling");
	return 0;
}

static int sdhc_stm32_card_busy(const struct device *dev)
{
	struct sdhc_stm32_data *dev_data = dev->data;

	/* Card is busy if mutex is locked */
	if (k_mutex_lock(&dev_data->bus_mutex, K_NO_WAIT) == 0) {
		/* Mutex was available, unlock and return not busy */
		k_mutex_unlock(&dev_data->bus_mutex);
		return 0;
	}

	/* Mutex was locked, card is busy */
	return 1;
}

static int sdhc_stm32_request(const struct device *dev, struct sdhc_command *cmd,
			      struct sdhc_data *data)
{
	int res = 0;
	struct sdhc_stm32_data *dev_data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);

	__ASSERT_NO_MSG(cmd != NULL);

	if (k_mutex_lock(&dev_data->bus_mutex, K_MSEC(cmd->timeout_ms))) {
		return -EBUSY;
	}

	if (sdhc_stm32_card_busy(dev)) {
		LOG_ERR("Card is busy");
		k_mutex_unlock(&dev_data->bus_mutex);
		return -ETIMEDOUT;
	}

	(void)pm_device_runtime_get(dev);

	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	switch (cmd->opcode) {
	case SD_GO_IDLE_STATE:
	case SD_ALL_SEND_CID:
	case SD_SEND_RELATIVE_ADDR:
	case SD_SELECT_CARD:
	case SD_APP_CMD:
	case SD_APP_SEND_OP_COND:
	case SD_SET_BLOCK_SIZE:
	case SD_SEND_STATUS:
	case SD_SEND_CSD:
	case SDIO_SEND_OP_COND:
	case SD_ERASE_BLOCK_START:
	case SD_ERASE_BLOCK_END:
	case SD_ERASE_BLOCK_OPERATION:
	case MMC_SEND_OP_COND:
		res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
		if (res == 0) {
			res = sdhc_stm32_set_response(dev_data, instance, cmd);
		}
		break;

	case SD_SEND_IF_COND:
		/* CMD8 is shared by SD_SEND_IF_COND and MMC_SEND_EXT_CSD. */
		if (data != NULL) {
			res = sdhc_stm32_mmc_read_ext_csd(dev_data, instance, cmd, data);
		} else {
			res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
			if (res == 0) {
				res = sdhc_stm32_set_response(dev_data, instance, cmd);
			}
		}
		break;

	case SD_SWITCH:
		/* CMD6 is shared: SD_SWITCH (data) vs MMC_SWITCH (no data). */
		if (data != NULL) {
			res = sdhc_stm32_switch_speed(instance, cmd->arg, data->data,
						      data->block_size,
						      data->blocks * data->block_size, dev_data);
		} else {
			res = sdhc_stm32_send_cmd(dev_data, instance, cmd);
			if (res == 0) {
				res = sdhc_stm32_set_response(dev_data, instance, cmd);
			}
		}
		break;

	case SD_WRITE_SINGLE_BLOCK:
	case SD_WRITE_MULTIPLE_BLOCK:
		__ASSERT_NO_MSG(data != NULL);
		res = sdhc_stm32_rw_blocks(cmd, dev, data, true);
		break;

	case SD_READ_SINGLE_BLOCK:
	case SD_READ_MULTIPLE_BLOCK:
		__ASSERT_NO_MSG(data != NULL);
		res = sdhc_stm32_rw_blocks(cmd, dev, data, false);
		break;

	case SDIO_RW_DIRECT:
		res = sdhc_stm32_sdio_rw_direct(dev_data, instance, cmd);
		break;

	case SDIO_RW_EXTENDED:
		__ASSERT_NO_MSG(data != NULL);
		res = sdhc_stm32_rw_extended(dev, cmd, data);
		break;

	case SD_VOL_SWITCH:
		res = sdhc_stm32_switch_to_1_8v(dev, cmd);
		break;

	case SD_APP_SEND_SCR:
		res = sdhc_stm32_find_scr(cmd, instance, dev_data, (uint32_t *)data->data,
					  data->block_size, data->blocks * data->block_size);
		break;

	default:
		LOG_DBG("Unsupported Command, opcode:%d", cmd->opcode);
		res = -ENOTSUP;
	}

	if (res != 0) {
		LOG_DBG("Command Failed, opcode:%d", cmd->opcode);
		/*
		 * Do not report timeout errors for CMD8 (SEND_IF_COND).
		 * A response timeout here is expected if the card is legacy (SDSC)
		 * and does not support CMD8, so this should not be treated as an error.
		 */
		if (!((cmd->opcode == SD_SEND_IF_COND) && (data == NULL) &&
		      (dev_data->error_code == SDMMC_ERROR_CMD_RSP_TIMEOUT))) {
			sdhc_stm32_log_err_type(dev_data);
		}
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);
	k_mutex_unlock(&dev_data->bus_mutex);

	return res;
}

static int sdhc_stm32_set_io(const struct device *dev, struct sdhc_io *ios)
{
	int res = 0;
	struct sdhc_stm32_data *data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);
	struct sdhc_io *host_io = &data->host_io;
	struct sdhc_host_props *props = &data->props;

	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	k_mutex_lock(&data->bus_mutex, K_FOREVER);

	if ((ios->clock != 0) && (host_io->clock != ios->clock)) {
		if ((ios->clock > props->f_max) || (ios->clock < props->f_min)) {
			LOG_ERR("Invalid clock frequency, domain (%u, %u)", props->f_min,
				props->f_max);
			res = -EINVAL;
			goto end;
		}

		if (data->sdmmc_clk == 0U) {
			LOG_ERR("SDMMC clock frequency not configured");
			res = -EIO;
			goto end;
		}

		/* Calculate clock divider
		 * Formula: clock_div = PeripheralClock / (2 * DesiredClock)
		 */
		uint32_t clock_div = data->sdmmc_clk / (2U * ios->clock);

		stm32_reg_modify_bits(&instance->CLKCR, SDMMC_CLKCR_CLKDIV, clock_div);

		host_io->clock = ios->clock;
		LOG_DBG("Clock set to %d", ios->clock);
	}

	if (ios->power_mode == SDHC_POWER_OFF) {
		(void)SDMMC_PowerState_OFF(instance);
		k_msleep(data->props.power_delay);
	} else {
		(void)SDMMC_PowerState_ON(instance);
		k_msleep(data->props.power_delay);
	}

	if ((ios->bus_width != 0) && (host_io->bus_width != ios->bus_width)) {
		uint32_t bus_width_reg_value;

		if (ios->bus_width == SDHC_BUS_WIDTH8BIT) {
			bus_width_reg_value = SDMMC_BUS_WIDE_8B;
		} else if (ios->bus_width == SDHC_BUS_WIDTH4BIT) {
			bus_width_reg_value = SDMMC_BUS_WIDE_4B;
		} else {
			bus_width_reg_value = SDMMC_BUS_WIDE_1B;
		}

		stm32_reg_modify_bits(&instance->CLKCR, SDMMC_CLKCR_WIDBUS,
				      bus_width_reg_value);
		host_io->bus_width = ios->bus_width;
	}

end:
	k_mutex_unlock(&data->bus_mutex);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);

	return res;
}

static void sdhc_stm32_init_props(const struct device *dev)
{
	const struct sdhc_stm32_config *sdhc_config = (const struct sdhc_stm32_config *)dev->config;
	struct sdhc_stm32_data *data = dev->data;
	struct sdhc_host_props *props = &data->props;

	memset(props, 0, sizeof(struct sdhc_host_props));

	props->f_min = sdhc_config->min_freq;
	props->f_max = sdhc_config->max_freq;
	props->power_delay = sdhc_config->power_delay_ms;
	props->host_caps.max_blk_len = 2;
	props->host_caps.vol_330_support = true;
	props->host_caps.vol_180_support = sdhc_config->support_1_8_v;
	props->host_caps.bus_8_bit_support = (sdhc_config->bus_width == SDHC_BUS_WIDTH8BIT);
	props->bus_4_bit_support = (sdhc_config->bus_width == SDHC_BUS_WIDTH4BIT);
}

static int sdhc_stm32_get_host_props(const struct device *dev, struct sdhc_host_props *props)
{
	struct sdhc_stm32_data *data = dev->data;

	memcpy(props, &data->props, sizeof(struct sdhc_host_props));

