zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32.c
	return 0;
}

static int sdhc_stm32_get_card_present(const struct device *dev)
{
	int res = 0;
	const struct sdhc_stm32_config *config = dev->config;

	/* If a CD pin is configured, use it for card detection */
	if (config->cd_gpio.port != NULL) {
		res = gpio_pin_get_dt(&config->cd_gpio);
		return res;
	}

	/* No CD pin configured, assume card is in slot */
	return 1;
}

static int sdhc_stm32_reset(const struct device *dev)
{
	struct sdhc_stm32_data *data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);

	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	k_mutex_lock(&data->bus_mutex, K_FOREVER);

	/* Resetting Host controller */
	(void)SDMMC_PowerState_OFF(instance);
	k_msleep(data->props.power_delay);
	(void)SDMMC_PowerState_ON(instance);
	k_msleep(data->props.power_delay);

	/* Clear error flags */
	__SDMMC_CLEAR_FLAG(instance, SDMMC_STATIC_FLAGS);
	data->error_code = SDMMC_ERROR_NONE;

	k_mutex_unlock(&data->bus_mutex);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);

	return 0;
}

static void sdhc_stm32_clear_icr_flags(SDMMC_TypeDef *instance)
{
	uint32_t icr_clear_flag = 0;
	uint32_t sta = instance->STA;

	if ((sta & SDMMC_STA_DCRCFAIL) != 0U) {
		icr_clear_flag |= SDMMC_ICR_DCRCFAILC;
	}

	if ((sta & SDMMC_STA_DTIMEOUT) != 0U) {
		icr_clear_flag |= SDMMC_ICR_DTIMEOUTC;
	}

	if ((sta & SDMMC_STA_TXUNDERR) != 0U) {
		icr_clear_flag |= SDMMC_ICR_TXUNDERRC;
	}

	if ((sta & SDMMC_STA_RXOVERR) != 0U) {
		icr_clear_flag |= SDMMC_ICR_RXOVERRC;
	}

	if (icr_clear_flag != 0U) {
		LOG_ERR("SDMMC interrupt err flag raised: 0x%08X", icr_clear_flag);
		instance->ICR = icr_clear_flag;
	}
}

void sdhc_stm32_event_isr(const struct device *dev)
{
	struct sdhc_stm32_data *data = dev->data;
	SDMMC_TypeDef *instance = sdhc_stm32_get_instance(dev);

	if (__SDMMC_GET_FLAG(instance, SDMMC_FLAG_DATAEND | SDMMC_FLAG_DCRCFAIL |
						       SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_RXOVERR |
						       SDMMC_FLAG_TXUNDERR)) {
		k_sem_give(&data->device_sync_sem);
	}

	sdhc_stm32_clear_icr_flags(instance);

	sdhc_stm32_irq_handler(instance, data);

	if (data->error_code != SDMMC_ERROR_NONE) {
		LOG_ERR("Error Interrupt");
		sdhc_stm32_log_err_type(data);
	}
}

static int sdhc_stm32_init(const struct device *dev)
{
	int ret;
	struct sdhc_stm32_data *data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	DEVICE_MMIO_MAP(dev, K_MEM_CACHE_NONE);

	if (config->sdhi_on_gpio.port != NULL) {
		if (sdhi_power_on(dev) != 0) {
			LOG_ERR("Failed to power card on");
			return -ENODEV;
		}
	}

	if (config->cd_gpio.port != NULL) {
		if (!device_is_ready(config->cd_gpio.port)) {
			LOG_ERR("Card detect GPIO device not ready");
			return -ENODEV;
		}

		ret = gpio_pin_configure_dt(&config->cd_gpio, GPIO_INPUT);
		if (ret < 0) {
			LOG_ERR("Couldn't configure card-detect pin; (%d)", ret);
			return ret;
		}
	}

	ret = sdhc_stm32_activate(dev);
	if (ret != 0) {
		LOG_ERR("Clock and GPIO could not be initialized for the SDHC module, err=%d", ret);
		return ret;
	}

	ret = sdhc_stm32_sd_init(dev);
	if (ret != 0) {
		LOG_ERR("SDHC init failed");
		sdhc_stm32_log_err_type(data);
		return ret;
	}

	LOG_INF("SDHC Init Passed Successfully");

	sdhc_stm32_init_props(dev);

	config->irq_config_func();
	k_sem_init(&data->device_sync_sem, 0, K_SEM_MAX_LIMIT);
	k_mutex_init(&data->bus_mutex);

	return ret;
}

static DEVICE_API(sdhc, sdhc_stm32_api) = {
	.request = sdhc_stm32_request,
	.set_io = sdhc_stm32_set_io,
	.get_host_props = sdhc_stm32_get_host_props,
	.get_card_present = sdhc_stm32_get_card_present,
	.card_busy = sdhc_stm32_card_busy,
	.reset = sdhc_stm32_reset,
};

#ifdef CONFIG_PM_DEVICE
static int sdhc_stm32_suspend(const struct device *dev)
{
	int ret;
	const struct sdhc_stm32_config *cfg = (struct sdhc_stm32_config *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Disable device clock. */
	ret = clock_control_off(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("Failed to disable SDHC clock during PM suspend process");
		return ret;
	}

	/* Move pins to sleep state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
	if (ret == -ENOENT) {
		/* Warn but don't block suspend */
		LOG_WRN_ONCE("SDHC pinctrl sleep state not available");
		return 0;
	}

	return ret;
}

static int sdhc_stm32_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		return sdhc_stm32_activate(dev);
	case PM_DEVICE_ACTION_SUSPEND:
		return sdhc_stm32_suspend(dev);
	default:
		return -ENOTSUP;
	}
}
#endif /* CONFIG_PM_DEVICE */

#define STM32_SDHC_IRQ_HANDLER(index)                                                              \
	static void sdhc_stm32_irq_config_func_##index(void)                                       \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(index, event, irq),                                \
			    DT_INST_IRQ_BY_NAME(index, event, priority), sdhc_stm32_event_isr,     \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQ_BY_NAME(index, event, irq));                                \
	}

#define SDHC_STM32_INIT(index)                                                                     \
                                                                                                   \
	STM32_SDHC_IRQ_HANDLER(index)                                                              \
                                                                                                   \
	static struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);                 \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	static const struct sdhc_stm32_config sdhc_stm32_cfg_##index = {                           \
		DEVICE_MMIO_ROM_INIT(DT_DRV_INST(index)),                                          \
		.irq_config_func = sdhc_stm32_irq_config_func_##index,                             \
		.pclken = pclken_##index,                                                          \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                     \
		.hw_flow_control = DT_INST_PROP(index, hw_flow_control),                           \
		.clk_div = DT_INST_PROP(index, clk_div),                                           \
		.bus_width = DT_INST_PROP(index, bus_width),                                       \
		.power_delay_ms = DT_INST_PROP(index, power_delay_ms),                             \
		.support_1_8_v = DT_INST_PROP(index, support_1_8_v),                               \
		.sdhi_on_gpio = GPIO_DT_SPEC_GET_OR(DT_DRV_INST(index), pwr_gpios, {0}),           \
		.cd_gpio = GPIO_DT_SPEC_GET_OR(DT_DRV_INST(index), cd_gpios, {0}),                 \
		.min_freq = DT_INST_PROP(index, min_bus_freq),                                     \
		.max_freq = DT_INST_PROP(index, max_bus_freq),                                     \
	};                                                                                         \
                                                                                                   \
	static struct sdhc_stm32_data sdhc_stm32_data_##index;                                     \
                                                                                                   \
	PM_DEVICE_DT_INST_DEFINE(index, sdhc_stm32_pm_action);                                     \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(index, &sdhc_stm32_init, PM_DEVICE_DT_INST_GET(index),               \
			      &sdhc_stm32_data_##index, &sdhc_stm32_cfg_##index, POST_KERNEL,      \
			      CONFIG_SDHC_INIT_PRIORITY, &sdhc_stm32_api);

DT_INST_FOREACH_STATUS_OKAY(SDHC_STM32_INIT)
